Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64MU206.h
#define RPINR40 RPINR40
extern volatile unsigned int  RPINR40 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR40BITS {
  union {
    struct {
      unsigned DTCMP4R:7;
      unsigned :1;
      unsigned DTCMP5R:7;
    };
    struct {
      unsigned DTCMP4R0:1;
      unsigned DTCMP4R1:1;
      unsigned DTCMP4R2:1;
      unsigned DTCMP4R3:1;
      unsigned DTCMP4R4:1;
      unsigned DTCMP4R5:1;
      unsigned DTCMP4R6:1;
      unsigned :1;
      unsigned DTCMP5R0:1;
      unsigned DTCMP5R1:1;
      unsigned DTCMP5R2:1;
      unsigned DTCMP5R3:1;
      unsigned DTCMP5R4:1;
      unsigned DTCMP5R5:1;
      unsigned DTCMP5R6:1;
    };
  };
} RPINR40BITS;
extern volatile RPINR40BITS RPINR40bits __attribute__((__sfr__));

#define RPINR41 RPINR41
extern volatile unsigned int  RPINR41 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR41BITS {
  union {
    struct {
      unsigned DTCMP6R:7;
    };
    struct {
      unsigned DTCMP6R0:1;
      unsigned DTCMP6R1:1;
      unsigned DTCMP6R2:1;
      unsigned DTCMP6R3:1;
      unsigned DTCMP6R4:1;
      unsigned DTCMP6R5:1;
      unsigned DTCMP6R6:1;
    };
  };
} RPINR41BITS;
extern volatile RPINR41BITS RPINR41bits __attribute__((__sfr__));

#define DFCON DFCON
extern volatile unsigned int  DFCON __attribute__((__sfr__));
__extension__ typedef struct tagDFCONBITS {
  union {
    struct {
      unsigned DFCMD:2;
      unsigned :1;
      unsigned DFIPE:1;
      unsigned DFERR:2;
      unsigned DFWREN:1;
      unsigned DFST:1;
      unsigned :5;
      unsigned DFIDL:1;
      unsigned DFRDY:1;
      unsigned DFEN:1;
    };
    struct {
      unsigned DFCMD0:1;
      unsigned DFCMD1:1;
      unsigned :2;
      unsigned DFERR0:1;
      unsigned DFERR1:1;
    };
  };
} DFCONBITS;
extern volatile DFCONBITS DFCONbits __attribute__((__sfr__));

#define DFKEY DFKEY
extern volatile unsigned int  DFKEY __attribute__((__sfr__));
#define DFADDR DFADDR
extern volatile unsigned int  DFADDR __attribute__((__sfr__));
typedef struct tagDFADDRBITS {
  unsigned DFADDR:9;
} DFADDRBITS;
extern volatile DFADDRBITS DFADDRbits __attribute__((__sfr__));

#define DFDATA DFDATA
extern volatile unsigned int  DFDATA __attribute__((__sfr__));
#define NVMCON NVMCON
extern volatile unsigned int  NVMCON __attribute__((__sfr__));
__extension__ typedef struct tagNVMCONBITS {
  union {
    struct {
      unsigned NVMOP:4;
      unsigned :4;
      unsigned URERR:1;
      unsigned RPDF:1;
      unsigned :2;
      unsigned NVMSIDL:1;
      unsigned WRERR:1;
      unsigned WREN:1;
      unsigned WR:1;
    };
    struct {
      unsigned NVMOP0:1;
      unsigned NVMOP1:1;
      unsigned NVMOP2:1;
      unsigned NVMOP3:1;
    };
  };
} NVMCONBITS;
extern volatile NVMCONBITS NVMCONbits __attribute__((__sfr__));

#define NVMADR NVMADR
extern volatile unsigned int  NVMADR __attribute__((__sfr__));
#define NVMADRL NVMADRL
extern volatile unsigned int  NVMADRL __attribute__((__sfr__));
#define NVMADRH NVMADRH
extern volatile unsigned int  NVMADRH __attribute__((__sfr__));
typedef struct tagNVMADRHBITS {
  unsigned ADDR:8;
} NVMADRHBITS;
extern volatile NVMADRHBITS NVMADRHbits __attribute__((__sfr__));

#define NVMADRU NVMADRU
extern volatile unsigned int  NVMADRU __attribute__((__sfr__));
typedef struct tagNVMADRUBITS {
  unsigned ADDR:8;
} NVMADRUBITS;
extern volatile NVMADRUBITS NVMADRUbits __attribute__((__sfr__));

#define NVMKEY NVMKEY
extern volatile unsigned int  NVMKEY __attribute__((__sfr__));
#define NVMSRCADR NVMSRCADR
extern volatile unsigned int  NVMSRCADR __attribute__((__sfr__));
#define NVMSRCADRL NVMSRCADRL
extern volatile unsigned int  NVMSRCADRL __attribute__((__sfr__));
#define RCON RCON
extern volatile unsigned int  RCON __attribute__((__sfr__));
typedef struct tagRCONBITS {
  unsigned POR:1;
  unsigned BOR:1;
  unsigned IDLE:1;
  unsigned SLEEP:1;
  unsigned WDTO:1;
  unsigned SWDTEN:1;
  unsigned SWR:1;
  unsigned EXTR:1;
  unsigned VREGS:1;
  unsigned CM:1;
  unsigned :1;
  unsigned VREGSF:1;
  unsigned :2;
  unsigned IOPUWR:1;
  unsigned TRAPR:1;
} RCONBITS;
extern volatile RCONBITS RCONbits __attribute__((__sfr__));

#define OSCCON OSCCON
extern volatile unsigned int  OSCCON __attribute__((__sfr__));
__extension__ typedef struct tagOSCCONBITS {
  union {
    struct {
      unsigned OSWEN:1;
      unsigned LPOSCEN:1;
      unsigned :1;
      unsigned CF:1;
      unsigned :1;
      unsigned LOCK:1;
      unsigned IOLOCK:1;
      unsigned CLKLOCK:1;
      unsigned NOSC:3;
      unsigned :1;
      unsigned COSC:3;
    };
    struct {
      unsigned :8;
      unsigned NOSC0:1;
      unsigned NOSC1:1;
      unsigned NOSC2:1;
      unsigned :1;
      unsigned COSC0:1;
      unsigned COSC1:1;
      unsigned COSC2:1;
    };
  };
} OSCCONBITS;
extern volatile OSCCONBITS OSCCONbits __attribute__((__sfr__));

#define OSCCONL OSCCONL
extern volatile unsigned char OSCCONL __attribute__((__sfr__));
#define OSCCONH OSCCONH
extern volatile unsigned char OSCCONH __attribute__((__sfr__));
#define CLKDIV CLKDIV
extern volatile unsigned int  CLKDIV __attribute__((__sfr__));
__extension__ typedef struct tagCLKDIVBITS {
  union {
    struct {
      unsigned PLLPRE:5;
      unsigned :1;
      unsigned PLLPOST:2;
      unsigned FRCDIV:3;
      unsigned DOZEN:1;
      unsigned DOZE:3;
      unsigned ROI:1;
    };
    struct {
      unsigned PLLPRE0:1;
      unsigned PLLPRE1:1;
      unsigned PLLPRE2:1;
      unsigned PLLPRE3:1;
      unsigned PLLPRE4:1;
      unsigned :1;
      unsigned PLLPOST0:1;
      unsigned PLLPOST1:1;
      unsigned FRCDIV0:1;
      unsigned FRCDIV1:1;
      unsigned FRCDIV2:1;
      unsigned :1;
      unsigned DOZE0:1;
      unsigned DOZE1:1;
      unsigned DOZE2:1;
    };
  };
} CLKDIVBITS;
extern volatile CLKDIVBITS CLKDIVbits __attribute__((__sfr__));

#define PLLFBD PLLFBD
extern volatile unsigned int  PLLFBD __attribute__((__sfr__));
__extension__ typedef struct tagPLLFBDBITS {
  union {
    struct {
      unsigned PLLDIV:9;
    };
    struct {
      unsigned PLLDIV0:1;
      unsigned PLLDIV1:1;
      unsigned PLLDIV2:1;
      unsigned PLLDIV3:1;
      unsigned PLLDIV4:1;
      unsigned PLLDIV5:1;
      unsigned PLLDIV6:1;
      unsigned PLLDIV7:1;
      unsigned PLLDIV8:1;
    };
  };
} PLLFBDBITS;
